Revit 2027 API
SolidSolidCutUtils.AddCutBetweenSolids(Document, Element, Element, Boolean) Method
 Adds a solid-solid cut for the two elements with the option to control splitting of faces of the cutting solid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static void AddCutBetweenSolids(
	Document document,
	Element solidToBeCut,
	Element cuttingSolid,
	bool splitFacesOfCuttingSolid
)
Public Shared Sub AddCutBetweenSolids (
	document As Document,
	solidToBeCut As Element,
	cuttingSolid As Element,
	splitFacesOfCuttingSolid As Boolean
)
public:
static void AddCutBetweenSolids(
	Document^ document,
	Element^ solidToBeCut,
	Element^ cuttingSolid,
	bool splitFacesOfCuttingSolid
)
static member AddCutBetweenSolids :
        document : Document *
        solidToBeCut : Element *
        cuttingSolid : Element *
        splitFacesOfCuttingSolid : bool -> unit
Parameters
document Document
 The document containing the two elements.
solidToBeCut Element
 The solid to be cut.
cuttingSolid Element
 The cutting solid.
splitFacesOfCuttingSolid Boolean
 True to split faces of cutting solid where it intersects the solid to be cut, false otherwise.
Exceptions
Exception | Condition
ArgumentException |  The element must be in a project document or in a conceptual model, pattern based curtain panel, or adaptive component family. -or- The element does not meet the condition that it must be solid and must be a GenericForm, GeomCombination, or a FamilyInstance.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  Failed to add solid-solid cut for the two elements.
See Also
Reference
SolidSolidCutUtils Class
AddCutBetweenSolids Overload
Autodesk.Revit.DB Namespace